import React from "react";
import { Layout } from "../../../templates/layout";
import * as XDE from "../../about/index"

export const Vision = () => (
	<Layout>
		<header>
			<h1>Vision</h1>
		</header>

		<section>
			<p>
				Хорошо это или плохо, но в какой-то далёкий момент истории человек восстал против
				естественного, натурального течения событий. Его перестало устраивать бесконечное
				ожидание удара молнии в дерево, чтобы добыть огонь, и он рискнул предложить
				вселенной свой, искуственный (en. artifical) порядок вещей.
			</p>

			<p>
				Так, задолго до музыки, поэзии и архитектуры появилось искусство (en. art). В
				нашем первом самостоятельно добытом огне, первом копье, первом сказанном слове.
				И так появились первые инженеры, что что дословно переводится как обладающий
				талантом воплощать в реальность.
			</p>

			<p>
				Они были первыми в музыке, создав инструменты. Они первыми научились
				рисовать, складывать слова в рифмы и многое из того, что мы сегодня относим к
				искусству и противопоставляем инженерным наукам.
			</p>
		</section>

		<section>
			<p>
				{XDE.Acronym} &mdash; это история про мир, в котором каждый новый день не должен
				быть похож на предыдущий.
			</p>
			<p>
				{XDE.Acronym} &mdash; это история про людей, которые создавали этот мир.
			</p>
			<p>
				{XDE.Acronym} &mdash; это история про искусство, которое окружает нас во всём.
			</p>
			<p>
				{XDE.ShortName} предлагает написать эту историю вместе.
			</p>
		</section>

		<section>
			<h2>Engine</h2>

			<p>
				TODO:Плавно перейти к гену, созданию, инженеру... Генетика - как нас создают, инжиниринг
				- как мы создаем. Можем ввести глагол engine.
			</p>

			<p>
				TODO:XDE будет создавать инженеров, которые буду создавать всё остальное и XDE в
				том числе.
			</p>
		</section>

		<section>
			<h2>Математика</h2>

			<p>
				TODO:Возможен перенос в <a href="/labs/academy/engineering">Academy</a>.
			</p>

			<p>
				Инженер создаёт <strong>продукт</strong>, который от него ожидает{" "}
				<strong>потребитель</strong> (удовлетворяет/создаёт его потребности). Продукт должен
				обладать определённой <a href="../academy/engineering">новизной</a>, чтобы
				потребитель предпочёл его <strong>конкурентам</strong>.
			</p>

			<p>
				На новизну может влиять множество факторов или <em>x</em>-факторов в терминах{" "}
				<em>x</em>DE:
				<ul>
					<li>
						eXcite - иногда эмоции от результата намного перевешивают финансовое
						вознаграждение;
					</li>
					<li>
						eXpenses (lean, eco-friendly) - чем расплачиваемся мы или наши потомки.
						Большинство крупных стартапов начинают казаться такими смешными когда
						начинаешь сравнивать что они делают и сколько это стоит, и что реально
						полезное можно было бы на это сделать. Да и сама индустрия венчурного
						инвестирования, когда они угадывают куда инвестировать только в 10% случаев.
						Небережливое ПО, околонулевая новизна ЯВУ.
					</li>
					<li>
						eXtraordinary - Возможно, отличительной особенность инженера является
						интуиция. В этом фишка созидания, когда что-то невозможно просто вычислить.
					</li>
				</ul>
			</p>

			<p>
				Важно понимать, кто именно является потребителем, а что - продуктом, поскольку
				правильный выбор оказывает ключевое влияние, но не всегда очевиден. Например,
				зачастую мы сами являемся потребителями.
			</p>

			<p>
				More problems, more fun. Success = was - become. Worse it was, greater will be
				success. Success = f(changes), Success = sum of changes. Tied with change
				management.
			</p>
		</section>

		<section>
			<h2>Философия</h2>
			<p>
				Инженерия - это суть искусства. Всё сущее вокруг нас можно разделить на натуральное
				и искуственное. Первое возникает без нашего в нём участия. Искусственное - это наши
				инженерные творения. И чем больше в нём новизны (engineer &rarr; ingenius &rarr;
				genius - "one who produces or generates [new] things"), тем сильнее нам хочется
				назвать это искусством. В английском языке artificial и art сохраняет те же
				принципы.
			</p>
			<p>Инженеры часто успешны в несвязанных областях.</p>
		</section>

		<section>
			<h2>Исследование признаков</h2>
			<p>
				<strong>Новизна</strong>. Характеризует созидательную роль, количественно
				эквивалентна excito, отличает инженера от учёного, формирует продукт, требует
				"открытый ум", любопытство. Есть условные параллели с добавленной стоимостью в
				экономике.
			</p>
			<p>
				<strong>Отношение к ошибкам</strong>. Связано с новизной, поскольку она &mdash; суть
				то, что никто никогда не делал.
			</p>
			<p>
				<strong>Риск</strong>. Логичное следствие из отношения к ошибкам.
			</p>
			<p>
				<strong>Конкуренция</strong>. Является точкой отсчёта новизны. К нему же можно
				отнести и критическое мышление.
			</p>
		</section>

		<section>
			<h2>Этимология / Словарь</h2>

			<ul>
				<li>engine</li>
				<li>epigone</li>
				<li>eugenics</li>
				<li>gender</li>
				<li>gen/gene</li>
				<li>general</li>
				<li>(de/re)generate</li>
				<li>generation</li>
				<li>generator</li>
				<li>generic</li>
				<li>genesis</li>
				<li>genetic</li>
				<li>genie</li>
				<li>genital</li>
				<li>genius</li>
				<li>genocide</li>
				<li>genre</li>
				<li>gentle</li>
				<li>-gen</li>
				<li>-gent</li>
				<li>-geny</li>
				<li>-genic</li>
				<li>-gone (epigone)?</li>
			</ul>
		</section>

		<section>
			<h2>InBox</h2>
			<p>
				Описать вначале, что под "инженер" неправильно подразумевают узкую специализацию.
				Плоды инженерии окружают нас повсюду. Инженеру пофиг, что инжинирить - то ли себя,
				то ли микропроцессор, то ли общественное мнение, то ли... Именно инженеры позволили
				нам жить с теми благами, с которыми мы живём сейчас (тут можно вообще весь путь
				развития человечества взять). Люди, создавшие первые музыкальные инструменты,
				корабли, телескопы вряд ли могли быть музыкантами, моряками или астрономами,
				поскольку не было ещё этих самых объектов их мастерства. Они создавали эти
				индустрии.
			</p>
			<p>
				Инженер создает (проактивен, человек действия). Ищет себе вызовы (конкуренция) и
				новизну (воспринимает все вокруг с точки зрения "что можно улучшить", "что можно
				использовать, чтобы что-то улучшить" использовать можно все!!).
			</p>
			<p>
				XDE.Team объединяет людей, любящих создавать, ориентируясь именно на это качество, а
				не на область применения.
			</p>
			<p>
				Инжиниринг имеет продолжительный excito-эффект, растянутый по времени эксплуатации
				продукта конечными пользователями и того, насколько они удовлетворены этой
				эксплуатацией.
			</p>
			<p>Может вывести кодекс инженера? Система ценностей XDE-инженера.</p>
			<p>
				Встретились как-то обыватель, учёный и инженер...:
				<ul>
					<li>
						Попали как-то на необитаемый обыватель, учёный и инженер. Обыватель начал
						собирать кокосы, учёный открыл 42 новых вида птиц, а инженер... выжил.
					</li>
				</ul>
			</p>
			<p>
				Сделайте какую-нибудь глупость и вас вряд ли назовут учёным, но инженером -
				запросто. Инженерам позволительно делать ерунду, есть у нас к ней такая программа
				толерантности.
			</p>
		</section>
	</Layout>
);

export default Vision;
