import { Article } from "@/components/Article";

const Page = () => (
    <Article>
        <h1>Egopolis</h1>

        <h2>InBox</h2>
        <p>
            Человек с древних времён создавал системы, которые могли помочь ему сделать то, что
            сложно было бы реализовать в одиночку. Начинались они с небольших, социальных, но
            постепенно росли. И вот уже эти системы &quot;восстали&quot; против их создателя
            и начали уничтожать человека во имя себя.
        </p>
        <p>
            Вчера мы создаём христианство, как религиозную систему любви и всепрощения, сегодня
            она уже начинает нас сжигать и вешать за недостаточное соответствие её текущим стандартам.
            Монархия, демократия, коммунизм, практически за каждой миллионы загубленных жизней во имя
            их же принципов.
        </p>
        <p>
            А что же человек? Как много людей выиграли от того, что они сейчас являются частью
            гигантской бюрократической машины в противовес проживанию небольшой комунной где-то
            на природе?
        </p>
        <p>
            Egopolis &ndash; это социальный эксперимент, который исследует возможность вернуться
            к интересам каждого человека. Не всех, что зачастую предполагает некоторую среднюю
            температуру по планете, а каждого.
        </p>
        <p>
            Ego polis = Политика с человеческим лицом.
        </p>
    </Article>
)

export default Page;
