export const Page = () => (
    <>
        <h1>Audit</h1>

        <p>
            Участие квалифицированных специалистов в разработке может быть не
            всегда доступно. Как финансово, так и физически, поскольку их число
            не настолько велико, чтобы хватить всем. Но их услуги могут быть
            использованы в небольшом объеме для аудита и оценки. Диагностика
            качества, исполнения спецификаций и графика, рисков, обмана.
        </p>

        <p>
            Мы - опытные исполнители. Знаем "кухню" с той стороны и можем
            использовать эти знания в пользу заказчиков.
        </p>
        <p>
            Аудит технической и проектной документации. Нам известно множество
            "трюков", которые могут использоваться разработчиками для не совсем
            честной игры.
        </p>
        <p>
            Помощь в выборе победителей тендера (в том числе, на фрилансерских
            сайтах). TODO: Формы аудита - Регулярный мониторинг проекта. Одного
            часа в день или даже в месяц бывает достаточно чтобы быть в курсе
            надвигающихся рисков.
        </p>
    </>
);

export default Page;
