import type { NextPage } from 'next'
import Head from 'next/head'

const Page: NextPage = () => {
    return (
        <div>
            <Head>
                <title>XDE.Team</title>
            </Head>

            <main>
                <h1>
                    HR
                </h1>

                <p>
                    Современный подход в HR основан исключительно на контроле и многоступенчатом отсеве
                    кандидатов. Что-то в разработчике систем искусственного интеллекта не понравилось
                    неопытному рекрутеру и первый оказывается в корзине. Не прошел &laquo;soft skills&raquo;
                    &ndash; в корзине. До проверки реальных навыков есть миллион причин не пройти прокрустово
                    ложе всевозможных контрольных точек. А если уровень нанимаего существенно превышает
                    уровень интервьюеров, то вероятность успешного прохождения на позицию стремится к нулю.
                </p>

                <p>
                    Как только кандидат нанят, всякий интерес рекрутеров к нему теряется и любая дальнейшая
                    ответственность снимается. Считается, что этот самородок, от проштудировавший пособия
                    по прохождению интервью, готов к реальной работе, столкновениям с техническими сложностями,
                    авралами, токсичным руководством и другими проблемами, просто потому, что он должным
                    образом выразил свою готовность на интервью.
                </p>

                <p>
                    Мы смотрим на этот процесс в другом, инженерном русле. HR - это не спринт
                    &laquo;нанял и забыл&raquo;, а долгосрочная стратегия по формированию профессионального,
                    лояльного, мотивированного коллектива. Работа ведётся постоянно, каждый день.
                </p>

                <p>
                    Вместо разовых инвестиций в человека в виде нескольких окладов при стандартных схемах
                    найма, вы платите десятую часть оклада, но ежемесячно, обеспечивая себя качественным
                    коллективом на длинной дистанции и страхуя себя от рисков.
                </p>

                <p>
                    TODO:Наивно предполагать, что нанимаего очень интересуют цели и задачи компании и другие
                    глупости стандартных концепций найма.
                </p>

                <p>
                    TODO:В тесном сотрудничестве с <a href="https://xde.academy">XDE.Academy</a>.
                </p>
            </main>
        </div>
    )
}

export default Page
