import React from "react";
import { Layout } from "../../../templates/layout";

export const Cx = () => (
	<Layout>
		<header>
			<h1>Язык Cx</h1>
		</header>

		<section>
			<p>
				Cx - <a href="#TODO:">мета-язык</a>. Он не конкурирует с другими языками, а
				координирует их. Результатом его работы могут быть исходные тексты на других языках.
			</p>
			<p>Из его мета-природы следует то, что он любит DSL.</p>
			<p>
				Транскрипция Cx (six) играет такую же роль как и в языке <a href="#TODO:">Forth</a>{" "}
				(четвёртое поколение языков). В нашем случае это - шестое.
			</p>
			<p>
				Символ "x" в названии имеет ту же природу гена, как и в бренде xDE. Язык является
				генеративным.
			</p>
			<p>
				В идеале, Cx должен выстроить мост между естественными языками, языками спецификаций
				и языками программирования. Язык для <a href="#TODO:">literate programming</a>.
			</p>
		</section>
	</Layout>
);

export default Cx;
