import React from "react";
import { Layout } from "../../../templates/layout";

export const Services = () => (
    <Layout>
        <header>
            <h1>Services</h1>
        </header>

        <section>
            <p>
                Бесплатное предоставление инжиниринговых услуг некоммерческим образовательным,
                научным, политическим и другим организациям, которые также занимаются
                инжинирингом и в некотором смысле разделают наши ценности.
            </p>

            <p>
                Инженерные инвестиции. Вместо капитала мы вкладываем свои компетенции в компании.
                Вместо необходимости приобретать, они получают их напрямую за небольшую долю в
                капитале.
            </p>
        </section>
    </Layout>
);

export default Services;
