import React from "react";
import { Layout } from "../../../../templates/layout";

export const Entropy = () => (
	<Layout>
		<header>
			<h1>Physics</h1>
		</header>

		<section>
			<h3>Практичная энтропия</h3>
			<p>
				Интересно продолжить исследование энтропии на пересечении с практичными её
				проявлениями. Человек, который мог бы заняться чем угодно с одинаковой вероятностью,
				но не занимается ничем. Когда мы приоритезируем задачи, то действуем по аналогии с
				перемещением частиц в определённую половину резервуара, так часто используемого для
				объяснения энтропии.
			</p>
		</section>
	</Layout>
);

export default Entropy;
